groups = {
    1: ['ก', 'ด', 'ถ', 'ท', 'ภ', 'า', 'ำ', 'ฤ', 'ฤา', '่', 'ุ'],
    2: ['ข', 'ช', 'ง', 'บ', 'ป', 'เ', 'แ', '้', 'ู'],
    3: ['ฆ', 'ต', 'ฑ', 'ฒ', '๋'],
    4: ['ค', 'ธ', 'ญ', 'ร', 'ษ', 'ะ', 'โ', 'ั', 'ิ'],
    5: ['ฉ', 'ฌ', 'ณ', 'น', 'ม', 'ห', 'ฮ', 'ฎ', 'ฬ', 'ึ'],
    6: ['จ', 'ล', 'ว', 'อ', 'ใ'],
    7: ['ซ', 'ศ', 'ส', 'ี', 'ื', '๊'],
    8: ['ผ', 'ฝ', 'พ', 'ฟ', 'ย', '็'],
    9: ['ฏ', 'ฐ', 'ไ', '์']
}

name = input("กรอกชื่อ : ")

name_chars = list(name)

x = 0

for c in name_chars:
    for num in range(1, 10):
        if c in groups[num]:
            x += num
            break   


groups1 = {
    1: [2 , 4 , 5 , 6 , 9 , 14 , 15 , 19 , 23 , 24 , 36 , 41 , 42 , 45 , 46 , 50 , 51 , 53 , 55 , 56 , 59 , 63 , 64 , 65],
    2: [20 , 32 , 40 , 44 , 69 , 79],
    3: [ 27 , 29 , 30]
}

if x in groups1[1]:
    print("Very Good")
elif x in groups1[2]:
    print("Good")
elif x in groups1[3]:
    print("Harmful")
else:
    print("error")